---
kind: property
id: P:Autodesk.Revit.DB.ScheduleField.Definition
source: html/0fa34479-59f2-7f67-4d16-48238dc4d2af.htm
---
# Autodesk.Revit.DB.ScheduleField.Definition Property

The ScheduleDefinition that this field belongs to.

## Syntax (C#)
```csharp
public ScheduleDefinition Definition { get; }
```